In [1]:
import re
import pandas as pd
import numpy as np
import seaborn as sns

## Data cleaning

In [2]:
# Load data
df = pd.read_csv('datasets/scraped.csv')
df

     code  number        price         city
0       3     344  229,000 AED  uae_sharjah
1       U    1313  109,000 AED    duabi_new
2       H    3222   72,000 AED    duabi_new
3       3    4441   38,000 AED  uae_sharjah
4       3    7776   38,000 AED  uae_sharjah
...   ...     ...          ...          ...
2741    X   81686     AED2,000    duabi_new
2742    X   91393     AED2,000    duabi_new
2743    X   91494     AED2,000    duabi_new
2744    X   91595     AED2,000    duabi_new
2745    X   91797     AED2,000    duabi_new

[2746 rows x 4 columns]

In [3]:
# Remove AED and commans from price
df['price'] = df['price'].replace(r"[a-zA-Z,]",'',regex = True).astype(int)
df

     code  number   price         city
0       3     344  229000  uae_sharjah
1       U    1313  109000    duabi_new
2       H    3222   72000    duabi_new
3       3    4441   38000  uae_sharjah
4       3    7776   38000  uae_sharjah
...   ...     ...     ...          ...
2741    X   81686    2000    duabi_new
2742    X   91393    2000    duabi_new
2743    X   91494    2000    duabi_new
2744    X   91595    2000    duabi_new
2745    X   91797    2000    duabi_new

[2746 rows x 4 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2746 entries, 0 to 2745
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   code    2746 non-null   object
 1   number  2746 non-null   int64
 2   price   2746 non-null   int32
 3   city    2746 non-null   object
dtypes: int32(1), int64(1), object(2)
memory usage: 75.2+ KB

In [5]:
# Check for repeating digits
df['number'].nunique()

# Seems to me there are repeating numbers.
# Will only keep the latest assuming its latest price.

2387

In [6]:
# Check if they have different codes
df[df.duplicated('number', keep = False)]

# Looks like same number but with different code so no need to drop

     code  number  price         city
24      3   44400  29000  uae_sharjah
41      H   40333  10900    duabi_new
43      L   40333  10900    duabi_new
44      N   40333  10900    duabi_new
45      P   40333  10900    duabi_new
...   ...     ...    ...          ...
1906    U   88373   2400    duabi_new
1909    U   88747   2400    duabi_new
1912    U   92282   2400    duabi_new
1922    U   99373   2400    duabi_new
1924    U   99646   2400    duabi_new

[603 rows x 4 columns]

In [7]:
# Check number of duplicated rows, >1 == duplicate
df.groupby(df.columns.tolist(),as_index=False).size()['size'].nunique()

# No need to drop any rows

1

In [8]:
# Fix the city columns
df['city'].unique()

array(['uae_sharjah', 'duabi_new', 'ajman_plate', 'oaq_plate'],
      dtype=object)

In [9]:
# Replace dict
city_replace = {
    'uae_sharjah':'Sharjah',
    'duabi_new':'Dubai',
    'ajman_plate':'Ajman',
    'oaq_plate':'OAQ'
}

# replace
df['city'] = df['city'].replace(city_replace)
df

     code  number   price     city
0       3     344  229000  Sharjah
1       U    1313  109000    Dubai
2       H    3222   72000    Dubai
3       3    4441   38000  Sharjah
4       3    7776   38000  Sharjah
...   ...     ...     ...      ...
2741    X   81686    2000    Dubai
2742    X   91393    2000    Dubai
2743    X   91494    2000    Dubai
2744    X   91595    2000    Dubai
2745    X   91797    2000    Dubai

[2746 rows x 4 columns]

In [10]:
# Check value counts
df['city'].value_counts()

# There isn't enough data to train on non 
# Dubai number plates, so for EDA and training, I'll only use Dubai plates

df = df[df['city'] == 'Dubai']
df = df[['number','code','price']]
df

      number code   price
1       1313    U  109000
2       3222    H   72000
27     30033    P   24000
28      7765    L   17500
29      8876    U   17500
...      ...  ...     ...
2741   81686    X    2000
2742   91393    X    2000
2743   91494    X    2000
2744   91595    X    2000
2745   91797    X    2000

[2694 rows x 3 columns]

In [11]:
# Save it for EDA 
df.to_csv('datasets/cleaned.csv', index = False)